app/controllers/admin/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    @admin_orders = Admin::Order.all

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_admin_order
      @admin_order = Admin::Order.find(params[:id])