app/controllers/admin/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @admin_products = Admin::Product.all

INSERT INTO "products" ("name", "description", "price", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "iPhone 6S"], ["description", "Apple"], ["price", 25000.0], ["stock", 10], ["created_at", "2015-09-18 14:19:17.487303"], ["updated_at", "2015-09-18 14:19:17.487303"]]
---
  def create
    @admin_product = Admin::Product.new(admin_product_params)

    respond_to do |format|
      if @admin_product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_admin_product
      @admin_product = Admin::Product.find(params[:id])