app/views/orders/show.html.erb

  <tbody>
    <% @order.line_items.each do |line_item| %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  [["order_id", 1]]

<ul>
  <% @order.trades.each do |trade| %>
---
SELECT "trades".* FROM "trades" WHERE "trades"."order_id" = ?  [["order_id", 1]]