app/views/carts/show.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 1]]
---
  <tbody>
    <% current_cart.line_items.each do |line_item| %>